[
  {
    "title": "Pluribus",
    "tvdbId": 436457,
    "tmdbId": 225171,
    "imdbId": "tt22202452",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nrM2xFUfKJJEmZzd5d7kohT2G0C.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy"
    ],
    "overview": "The most miserable person on Earth must save the world from happiness.",
    "firstAirDate": "2025-11-06",
    "networks": [
      "Apple TV"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 9,
    "imdbRating": 8.1,
    "reason": "Critically acclaimed with an outstanding 87 Metacritic score and 8.1 IMDb rating from over 76,000 votes, this Apple TV+ series is from acclaimed creator Vince Gilligan and stars Rhea Seehorn."
  },
  {
    "title": "IT: Welcome to Derry",
    "tvdbId": 418424,
    "tmdbId": 200875,
    "imdbId": "tt19244304",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nyy3BITeIjviv6PFIXtqvc8i6xi.jpg",
    "genres": [
      "drama",
      "mystery"
    ],
    "overview": "In 1962, amid a spate of unexplained disappearances of local children, a group of misfit friends begin to suspect a long-buried ancient evil lurking. As the kids set out to determine what's really going on, a rising unease prompts several townspeople to work together to restore peace – all while a U.S. military operation seeks to exploit Derry for its own objectives.",
    "firstAirDate": "2025-10-26",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 8,
    "reason": "As an HBO prequel to the popular 'IT' franchise, it boasts an impressive 8.0 IMDb rating from over 71,000 votes, driven by the established success of its source material and creators."
  },
  {
    "title": "A Knight of the Seven Kingdoms",
    "tvdbId": 433631,
    "tmdbId": 224372,
    "imdbId": "tt27497448",
    "posterUrl": "http://image.tmdb.org/t/p/w500/6igvNs5VJB4ryBLgjjXksDVs0Fm.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy",
      "action_adventure"
    ],
    "overview": "A century before the events of Game of Thrones, two unlikely heroes wandered Westeros: a young, naive but courageous knight, Ser Duncan the Tall, and his diminutive squire, Egg. Set in an age when the Targaryen line still holds the Iron Throne and the last dragon has not yet passed from living memory, great destinies, powerful foes, and dangerous exploits await these improbable and incomparable friends.",
    "firstAirDate": "2026-01-18",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 2,
    "numberOfEpisodes": 7,
    "imdbRating": null,
    "reason": "This HBO series, set in the 'Game of Thrones' universe and created by George R. R. Martin, is highly anticipated due to its prestigious network and connection to a globally popular franchise."
  },
  {
    "title": "Monster: The Ed Gein Story",
    "tvdbId": null,
    "tmdbId": 286801,
    "posterUrl": "http://image.tmdb.org/t/p/w500/iDHzRALtZCzHVmx7uyjTTKvMAPB.jpg",
    "genres": [
      "drama",
      "crime"
    ],
    "overview": "The shocking true-life tale of Ed Gein, the infamous murderer and grave robber who inspired many of Hollywood's most iconic on-screen killers.",
    "firstAirDate": "2025-10-03",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": null,
    "reason": "Part of Netflix's highly successful 'Monster' anthology series and produced by Ryan Murphy, this show starring Charlie Hunnam is poised for high viewership due to its popular true-crime genre and established brand."
  },
  {
    "title": "Boots",
    "tvdbId": 434473,
    "tmdbId": 225647,
    "imdbId": "tt27987047",
    "posterUrl": "http://image.tmdb.org/t/p/w500/eEwe68oPFFDU4ehZ3sXiETE44Rt.jpg",
    "genres": [
      "comedy",
      "drama",
      "war_politics"
    ],
    "overview": "After impulsively joining the U.S. Marine Corps, a bullied teen finds new purpose — and unexpected brotherhood — with his motley team of fellow recruits.",
    "firstAirDate": "2025-10-09",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 7.9,
    "reason": "This Netflix drama features well-known actress Vera Farmiga and has garnered a strong 7.9 IMDb rating from over 22,000 votes, indicating significant audience approval and engagement."
  }
]