[
  {
    "title": "Pluribus",
    "tvdbId": 436457,
    "tmdbId": 225171,
    "imdbId": "tt22202452",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nrM2xFUfKJJEmZzd5d7kohT2G0C.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy"
    ],
    "overview": "The most miserable person on Earth must save the world from happiness.",
    "firstAirDate": "2025-11-06",
    "networks": [
      "Apple TV"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 9,
    "imdbRating": 8.1,
    "reason": "Critically acclaimed with an 87 Metacritic score and an 8.1 IMDb rating from over 76,000 votes. Created by 'Breaking Bad' mastermind Vince Gilligan and starring Rhea Seehorn, it's a highly anticipated Apple TV series."
  },
  {
    "title": "IT: Welcome to Derry",
    "tvdbId": 418424,
    "tmdbId": 200875,
    "imdbId": "tt19244304",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nyy3BITeIjviv6PFIXtqvc8i6xi.jpg",
    "genres": [
      "drama",
      "mystery"
    ],
    "overview": "In 1962, amid a spate of unexplained disappearances of local children, a group of misfit friends begin to suspect a long-buried ancient evil lurking. As the kids set out to determine what's really going on, a rising unease prompts several townspeople to work together to restore peace – all while a U.S. military operation seeks to exploit Derry for its own objectives.",
    "firstAirDate": "2025-10-26",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 8,
    "reason": "A highly anticipated HBO series with an 8.0 IMDb rating from over 71,000 votes and an 8.2 TMDB score. It benefits from the popular 'IT' franchise and the involvement of director Andy Muschietti."
  },
  {
    "title": "Task",
    "tvdbId": 451873,
    "tmdbId": 228305,
    "imdbId": "tt28013708",
    "posterUrl": "http://image.tmdb.org/t/p/w500/1st54ceDVocWItwsfWQbGCh5vxa.jpg",
    "genres": [
      "crime",
      "drama"
    ],
    "overview": "In the working-class suburbs of Philadelphia, an FBI agent heads a task force assembled to put an end to a string of violent robberies led by an unsuspecting family man.",
    "firstAirDate": "2025-09-07",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 7,
    "imdbRating": 8,
    "reason": "An HBO crime drama boasting an 8.0 IMDb rating from over 45,000 votes and a strong 77 Metacritic score. It features A-list actor Mark Ruffalo and is created by Brad Ingelsby ('Mare of Easttown')."
  },
  {
    "title": "Black Rabbit",
    "tvdbId": 447579,
    "tmdbId": 249039,
    "imdbId": "tt23055142",
    "posterUrl": "http://image.tmdb.org/t/p/w500/4e9CraVtGY00jLP2YGwsuEtaIjR.jpg",
    "genres": [
      "drama",
      "crime"
    ],
    "overview": "A rising-star restaurateur is forced into New York's criminal underworld when his chaotic brother returns to town with loan sharks on his trail.",
    "firstAirDate": "2025-09-18",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 7.4,
    "reason": "A Netflix drama with a 7.4 IMDb rating from over 35,000 votes, featuring a star-studded cast including Jason Bateman and Jude Law, whose production companies are also involved."
  },
  {
    "title": "Monster: The Ed Gein Story",
    "tvdbId": null,
    "tmdbId": 286801,
    "posterUrl": "http://image.tmdb.org/t/p/w500/iDHzRALtZCzHVmx7uyjTTKvMAPB.jpg",
    "genres": [
      "drama",
      "crime"
    ],
    "overview": "The shocking true-life tale of Ed Gein, the infamous murderer and grave robber who inspired many of Hollywood's most iconic on-screen killers.",
    "firstAirDate": "2025-10-03",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": null,
    "reason": "Part of the popular 'Monster' anthology, this Netflix series is produced by the prolific Ryan Murphy Television and stars Charlie Hunnam, generating significant buzz despite limited initial rating data."
  }
]