[
  {
    "title": "IT: Welcome to Derry",
    "tvdbId": 418424,
    "tmdbId": 200875,
    "imdbId": "tt19244304",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nyy3BITeIjviv6PFIXtqvc8i6xi.jpg",
    "genres": [
      "drama",
      "mystery"
    ],
    "overview": "In 1962, amid a spate of unexplained disappearances of local children, a group of misfit friends begin to suspect a long-buried ancient evil lurking. As the kids set out to determine what's really going on, a rising unease prompts several townspeople to work together to restore peace – all while a U.S. military operation seeks to exploit Derry for its own objectives.",
    "firstAirDate": "2025-10-26",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 8,
    "reason": "A highly anticipated prequel from 'IT' director Andy Muschietti, boasting an 8.0 IMDb rating from over 71K votes on prestigious HBO."
  },
  {
    "title": "Pluribus",
    "tvdbId": 436457,
    "tmdbId": 225171,
    "imdbId": "tt22202452",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nrM2xFUfKJJEmZzd5d7kohT2G0C.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy"
    ],
    "overview": "The most miserable person on Earth must save the world from happiness.",
    "firstAirDate": "2025-11-06",
    "networks": [
      "Apple TV"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 9,
    "imdbRating": 8.1,
    "reason": "Critically acclaimed with an 87 Metacritic score and 8.1 IMDb rating from 76K+ votes. Helmed by renowned creator Vince Gilligan on prestigious Apple TV."
  },
  {
    "title": "Heated Rivalry",
    "tvdbId": 464461,
    "tmdbId": 301507,
    "imdbId": "tt35495073",
    "posterUrl": "http://image.tmdb.org/t/p/w500/epgr7n61vVIniyAghz2GYj22DkC.jpg",
    "genres": [
      "drama"
    ],
    "overview": "Two of the biggest stars in Major League Hockey are bound by ambition, rivalry, and a magnetic pull neither of them fully understands. What begins as a secret fling between two fresh faced rookies evolves into a years-long journey of love, denial, and self-discovery. Over the next eight years, as they chase glory on the ice, they struggle to navigate their feelings for each other. Torn between the sport they live for and the love they can’t ignore, they must decide if there’s room in their fiercely competitive world for something as fragile – and powerful – as real love.",
    "firstAirDate": "2025-11-28",
    "networks": [
      "Crave"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 6,
    "imdbRating": 9.2,
    "reason": "Achieved an exceptionally high 9.2 IMDb rating from nearly 50K votes, indicating a strong and dedicated fanbase."
  },
  {
    "title": "Task",
    "tvdbId": 451873,
    "tmdbId": 228305,
    "imdbId": "tt28013708",
    "posterUrl": "http://image.tmdb.org/t/p/w500/1st54ceDVocWItwsfWQbGCh5vxa.jpg",
    "genres": [
      "crime",
      "drama"
    ],
    "overview": "In the working-class suburbs of Philadelphia, an FBI agent heads a task force assembled to put an end to a string of violent robberies led by an unsuspecting family man.",
    "firstAirDate": "2025-09-07",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 7,
    "imdbRating": 8,
    "reason": "Features A-list actor Mark Ruffalo and acclaimed creator Brad Ingelsby ('Mare of Easttown'), achieving an 8.0 IMDb rating from 45K+ votes on HBO."
  }
]