[
  {
    "title": "Pluribus",
    "tvdbId": 436457,
    "tmdbId": 225171,
    "imdbId": "tt22202452",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nrM2xFUfKJJEmZzd5d7kohT2G0C.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy"
    ],
    "overview": "The most miserable person on Earth must save the world from happiness.",
    "firstAirDate": "2025-11-06",
    "networks": [
      "Apple TV"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 9,
    "imdbRating": 8.1,
    "reason": "Created by acclaimed showrunner Vince Gilligan, this Apple TV series is a critical darling with an outstanding 87 Metacritic score and an 8.1 IMDb rating from over 76,000 votes, highlighting its immense anticipation and strong reception."
  },
  {
    "title": "IT: Welcome to Derry",
    "tvdbId": 418424,
    "tmdbId": 200875,
    "imdbId": "tt19244304",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nyy3BITeIjviv6PFIXtqvc8i6xi.jpg",
    "genres": [
      "drama",
      "mystery"
    ],
    "overview": "In 1962, amid a spate of unexplained disappearances of local children, a group of misfit friends begin to suspect a long-buried ancient evil lurking. As the kids set out to determine what's really going on, a rising unease prompts several townspeople to work together to restore peace – all while a U.S. military operation seeks to exploit Derry for its own objectives.",
    "firstAirDate": "2025-10-26",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 8,
    "reason": "As an HBO prequel set in Stephen King's iconic 'IT' universe, this show benefits from a massive built-in fanbase and boasts an impressive 8.0 IMDb rating from over 71,000 votes, indicating significant cultural relevance."
  },
  {
    "title": "A Knight of the Seven Kingdoms",
    "tvdbId": 433631,
    "tmdbId": 224372,
    "imdbId": "tt27497448",
    "posterUrl": "http://image.tmdb.org/t/p/w500/6igvNs5VJB4ryBLgjjXksDVs0Fm.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy",
      "action_adventure"
    ],
    "overview": "A century before the events of Game of Thrones, two unlikely heroes wandered Westeros: a young, naive but courageous knight, Ser Duncan the Tall, and his diminutive squire, Egg. Set in an age when the Targaryen line still holds the Iron Throne and the last dragon has not yet passed from living memory, great destinies, powerful foes, and dangerous exploits await these improbable and incomparable friends.",
    "firstAirDate": "2026-01-18",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 6,
    "imdbRating": null,
    "reason": "This HBO series is a highly anticipated entry into George R. R. Martin's globally popular Game of Thrones world, ensuring widespread interest and a strong 74 Metacritic score."
  },
  {
    "title": "Boots",
    "tvdbId": 434473,
    "tmdbId": 225647,
    "imdbId": "tt27987047",
    "posterUrl": "http://image.tmdb.org/t/p/w500/eEwe68oPFFDU4ehZ3sXiETE44Rt.jpg",
    "genres": [
      "comedy",
      "drama",
      "war_politics"
    ],
    "overview": "After impulsively joining the U.S. Marine Corps, a bullied teen finds new purpose — and unexpected brotherhood — with his motley team of fellow recruits.",
    "firstAirDate": "2025-10-09",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 7.9,
    "reason": "This Netflix drama demonstrates strong audience approval with a 7.9 IMDb rating from over 22,000 votes and a solid 73 Metacritic score, further boosted by the presence of well-known actress Vera Farmiga."
  },
  {
    "title": "The Beast in Me",
    "tvdbId": 448245,
    "tmdbId": 250504,
    "imdbId": "tt31974367",
    "posterUrl": "http://image.tmdb.org/t/p/w500/jxf7JCfIMvGONWTNUIJ068sFixK.jpg",
    "genres": [
      "drama",
      "mystery"
    ],
    "overview": "A famous author is pulled into a twisted mind game with her rich, powerful new neighbor — who might be a murderer.",
    "firstAirDate": "2025-11-13",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 7.5,
    "reason": "Featuring Emmy-winning actors Claire Danes and Matthew Rhys, this Netflix mystery has garnered a strong 7.5 IMDb rating from over 21,000 votes and a respectable 71 Metacritic score, appealing to both critics and a wide audience."
  }
]