[
  {
    "title": "Pluribus",
    "tvdbId": 436457,
    "tmdbId": 225171,
    "imdbId": "tt22202452",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nrM2xFUfKJJEmZzd5d7kohT2G0C.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy"
    ],
    "overview": "The most miserable person on Earth must save the world from happiness.",
    "firstAirDate": "2025-11-06",
    "networks": [
      "Apple TV"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 9,
    "imdbRating": 8.1,
    "reason": "Created by acclaimed showrunner Vince Gilligan, this Apple TV+ series boasts an exceptional 87 Metacritic score and an 8.1 IMDb rating from over 76,000 votes, indicating strong critical and audience reception."
  },
  {
    "title": "IT: Welcome to Derry",
    "tvdbId": 418424,
    "tmdbId": 200875,
    "imdbId": "tt19244304",
    "posterUrl": "http://image.tmdb.org/t/p/w500/nyy3BITeIjviv6PFIXtqvc8i6xi.jpg",
    "genres": [
      "drama",
      "mystery"
    ],
    "overview": "In 1962, amid a spate of unexplained disappearances of local children, a group of misfit friends begin to suspect a long-buried ancient evil lurking. As the kids set out to determine what's really going on, a rising unease prompts several townspeople to work together to restore peace – all while a U.S. military operation seeks to exploit Derry for its own objectives.",
    "firstAirDate": "2025-10-26",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 8,
    "reason": "This HBO series benefits from the popular 'IT' franchise, achieving an impressive 8.0 IMDb rating from over 71,000 votes and a strong 8.2 TMDB score, demonstrating significant audience engagement."
  },
  {
    "title": "A Knight of the Seven Kingdoms",
    "tvdbId": 433631,
    "tmdbId": 224372,
    "imdbId": "tt27497448",
    "posterUrl": "http://image.tmdb.org/t/p/w500/6igvNs5VJB4ryBLgjjXksDVs0Fm.jpg",
    "genres": [
      "drama",
      "sci_fi_fantasy",
      "action_adventure"
    ],
    "overview": "A century before the events of Game of Thrones, two unlikely heroes wandered Westeros: a young, naive but courageous knight, Ser Duncan the Tall, and his diminutive squire, Egg. Set in an age when the Targaryen line still holds the Iron Throne and the last dragon has not yet passed from living memory, great destinies, powerful foes, and dangerous exploits await these improbable and incomparable friends.",
    "firstAirDate": "2026-01-18",
    "networks": [
      "HBO"
    ],
    "numberOfSeasons": 2,
    "numberOfEpisodes": 7,
    "imdbRating": null,
    "reason": "Set in the highly popular Game of Thrones universe and created by George R. R. Martin for HBO, this series has high anticipation and a solid 74 Metacritic score, promising significant cultural impact."
  },
  {
    "title": "Monster: The Ed Gein Story",
    "tvdbId": null,
    "tmdbId": 286801,
    "posterUrl": "http://image.tmdb.org/t/p/w500/iDHzRALtZCzHVmx7uyjTTKvMAPB.jpg",
    "genres": [
      "drama",
      "crime"
    ],
    "overview": "The shocking true-life tale of Ed Gein, the infamous murderer and grave robber who inspired many of Hollywood's most iconic on-screen killers.",
    "firstAirDate": "2025-10-03",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": null,
    "reason": "From prolific creator Ryan Murphy and starring Charlie Hunnam, this Netflix series is part of a highly successful anthology, ensuring significant buzz and audience interest."
  },
  {
    "title": "Boots",
    "tvdbId": 434473,
    "tmdbId": 225647,
    "imdbId": "tt27987047",
    "posterUrl": "http://image.tmdb.org/t/p/w500/eEwe68oPFFDU4ehZ3sXiETE44Rt.jpg",
    "genres": [
      "comedy",
      "drama",
      "war_politics"
    ],
    "overview": "After impulsively joining the U.S. Marine Corps, a bullied teen finds new purpose — and unexpected brotherhood — with his motley team of fellow recruits.",
    "firstAirDate": "2025-10-09",
    "networks": [
      "Netflix"
    ],
    "numberOfSeasons": 1,
    "numberOfEpisodes": 8,
    "imdbRating": 7.9,
    "reason": "A Netflix original with a strong 7.9 IMDb rating from over 22,000 votes and a 73 Metacritic score, 'Boots' features well-known actress Vera Farmiga, contributing to its broad appeal."
  }
]